## Pandas

In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.2.4'

1. Series 
2. DataFrame

In [3]:
# series is a single dimentional

In [5]:
data = [1,2,3,4,5,6,7,8,9]
s1 = pd.Series(data)
s1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [7]:
type(s1) #OBJECT OF SERIES TYPE

pandas.core.series.Series

In [9]:
s1.values #form of NDRA

array([1, 2, 3, 4, 5, 6, 7, 8, 9], dtype=int64)

In [11]:
s1.index 
#it is iterable object 0 to 9 with step size 1

RangeIndex(start=0, stop=9, step=1)

In [12]:
# if i want to reset index
data = [1,2,3,4,5]
s2 = pd.Series(data)

In [13]:
s2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
s2.index = ['a','b','c','d','e']
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

### How to accses the values of series 
1. by position
2. by labels

In [17]:
#position
s1[0] # reverse indexing is not possiblee.g. s1[-1]

1

In [21]:
#by label
s2.iloc[2]

3

In [20]:
s2.loc['c']

3

In [23]:
s2['c'] = 5
s2

a    1
b    2
c    5
d    4
e    5
dtype: int64

In [25]:
s2['f'] = 6
s2

a    1
b    2
c    5
d    4
e    5
f    6
dtype: int64

In [26]:
s2.loc['g'] = 7

In [27]:
s2

a    1
b    2
c    5
d    4
e    5
f    6
g    7
dtype: int64

In [28]:
# performing search operation 
1 in s1.values

True

In [29]:
'c' in s2.index

True

In [33]:
s2[1:4:2] # 1 to 5 index in 2 steps

b    2
d    4
dtype: int64

In [44]:
# creating dict
data = {'Jaipur' : 'Rajasthan',
       'Mumbai' : 'Maharashtra',
       'Kolkata' : 'West Bengal',
       'Bengaluru' : 'Karnataka',
       'Chandigrah' :'Panjab'}
s2 = pd.Series(data)
s2

Jaipur          Rajasthan
Mumbai        Maharashtra
Kolkata       West Bengal
Bengaluru       Karnataka
Chandigrah         Panjab
dtype: object

In [45]:
s2.name = 'Capitals and States'
s2.index.name = 'Capitals'
s2

Capitals
Jaipur          Rajasthan
Mumbai        Maharashtra
Kolkata       West Bengal
Bengaluru       Karnataka
Chandigrah         Panjab
Name: Capitals and States, dtype: object

In [47]:
s2['Jaipur']

'Rajasthan'

In [48]:
s2[['Jaipur','Kolkata','Mumbai']]

Capitals
Jaipur       Rajasthan
Kolkata    West Bengal
Mumbai     Maharashtra
Name: Capitals and States, dtype: object

In [49]:
s2[['Jaipur']]

Capitals
Jaipur    Rajasthan
Name: Capitals and States, dtype: object

In [50]:
capitals = ['Jaipur','Kolkata','Mumbai','Delhi'] 
s3 = pd.Series(s2,index = capitals )
s3

Jaipur       Rajasthan
Kolkata    West Bengal
Mumbai     Maharashtra
Delhi              NaN
Name: Capitals and States, dtype: object

In [51]:
# to check null value
s3.isnull()

Jaipur     False
Kolkata    False
Mumbai     False
Delhi       True
Name: Capitals and States, dtype: bool

In [52]:
# 2nd method 
s3.notnull()

Jaipur      True
Kolkata     True
Mumbai      True
Delhi      False
Name: Capitals and States, dtype: bool

In [53]:
s3.duplicated()

Jaipur     False
Kolkata    False
Mumbai     False
Delhi      False
Name: Capitals and States, dtype: bool

In [54]:
s3.duplicated().sum()

0

In [55]:
s2 = pd.Series(['India','Austrailia','England'], index = ['Cricket','Cricket','Cricket'])

In [56]:
s2

Cricket         India
Cricket    Austrailia
Cricket       England
dtype: object

In [58]:
s2['Cricket'] # just showing possibilities of same index

Cricket         India
Cricket    Austrailia
Cricket       England
dtype: object

## DataFrame

In [59]:
# is more than 1 dimention

In [60]:
student1 = pd.Series({'Name': 'Utkarsh', 'Id':1})
student2 = pd.Series({'Name': 'Vipul', 'Id':2})
student3 = pd.Series({'Name': 'Hareesh', 'Id':3})

In [61]:
df1 = pd.DataFrame([student1,student2,student3], index = [101,102,103])

In [62]:
df1

        Name  Id
101  Utkarsh   1
102    Vipul   2
103  Hareesh   3

In [64]:
data = {'Name':['Utkarsh','Vipul','Hareesh'],'Id':[1,2,3]}
df2 = pd.DataFrame(data, index = [101,102,103])
df2

        Name  Id
101  Utkarsh   1
102    Vipul   2
103  Hareesh   3

In [71]:
# DataFrame atributes pd.DataFrame(data, index, columns)
df3 = pd.DataFrame(data = data , index= [101,102,103],columns = ['Name','Id','Age'])
# index are the more like lables

In [70]:
df3 # no values in Age so it showes NaN (Not a Number)

        Name  Id  Age
101  Utkarsh   1  NaN
102    Vipul   2  NaN
103  Hareesh   3  NaN

In [72]:
df3.index

Int64Index([101, 102, 103], dtype='int64')

In [73]:
df3.values

array([['Utkarsh', 1, nan],
       ['Vipul', 2, nan],
       ['Hareesh', 3, nan]], dtype=object)

In [74]:
df3.columns

Index(['Name', 'Id', 'Age'], dtype='object')

In [75]:
# assigning values to coloumns
df3.Age = 25

In [76]:
df3

        Name  Id  Age
101  Utkarsh   1   25
102    Vipul   2   25
103  Hareesh   3   25

In [77]:
df3.Age = [25,26,27]

In [78]:
df3

        Name  Id  Age
101  Utkarsh   1   25
102    Vipul   2   26
103  Hareesh   3   27

In [79]:
df3.Age

101    25
102    26
103    27
Name: Age, dtype: int64

In [80]:
df3.Name

101    Utkarsh
102      Vipul
103    Hareesh
Name: Name, dtype: object

In [81]:
df3

        Name  Id  Age
101  Utkarsh   1   25
102    Vipul   2   26
103  Hareesh   3   27

In [84]:
df3.iloc[0]

Name    Utkarsh
Id            1
Age          25
Name: 101, dtype: object

In [85]:
df3.loc[101]

Name    Utkarsh
Id            1
Age          25
Name: 101, dtype: object

In [87]:
df3.loc[104] = ['Suraj',4,26]
df3

        Name  Id  Age
101  Utkarsh   1   25
102    Vipul   2   26
103  Hareesh   3   27
104    Suraj   4   26

In [88]:
df3['Age']

101    25
102    26
103    27
104    26
Name: Age, dtype: int64

In [89]:
df3[['Age', 'Name']]

     Age     Name
101   25  Utkarsh
102   26    Vipul
103   27  Hareesh
104   26    Suraj

In [92]:
df3[1:3]

        Name  Id  Age
102    Vipul   2   26
103  Hareesh   3   27

In [94]:
df3[:]

        Name  Id  Age
101  Utkarsh   1   25
102    Vipul   2   26
103  Hareesh   3   27
104    Suraj   4   26

In [95]:
#accseing specific values

In [96]:
df3.loc[101]['Name']

'Utkarsh'

In [99]:
df3.loc[102]['Name']

'Vipul'

In [102]:
df3['Name'][102] #without loc
# for without loc first define column name then rows index

'Vipul'

In [105]:
df3['Name'][102] = 'Kiran'

<ipython-input-105-c7a49c9ba9c5>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['Name'][102] = 'Kiran'

In [106]:
df3['Name'][102]

'Kiran'

In [107]:
df3.loc[104]['Age']

26

In [108]:
df3.loc[101][["Name","Age"]]

Name    Utkarsh
Age          25
Name: 101, dtype: object

In [110]:
df3.loc[101,'Name']
# df3.loc[row, column]

'Utkarsh'

In [111]:
df3.loc[101,['Name','Age']]

Name    Utkarsh
Age          25
Name: 101, dtype: object

In [112]:
df3.loc[[101,102],['Name','Age']]

        Name  Age
101  Utkarsh   25
102    Kiran   26

In [120]:
# for position we use iloc
df3.iloc[0,0]

'Utkarsh'

In [121]:
df3.iloc[0]

Name    Utkarsh
Id            1
Age          25
Name: 101, dtype: object

In [122]:
df3.iloc[2]['Name']

'Hareesh'

In [124]:
df3.iloc[2][['Name','Age']]
# for multiple setection row or columns need to use [[]] 2 square braces

Name    Hareesh
Age          27
Name: 103, dtype: object

In [126]:
type(df3.iloc[0])

pandas.core.series.Series

In [127]:
df3.iloc[[0,1]]

        Name  Id  Age
101  Utkarsh   1   25
102    Kiran   2   26

In [128]:
df3.iloc[[0,1]]['Name']

101    Utkarsh
102      Kiran
Name: Name, dtype: object

Not completed